[  
   {  
      "content":"This has to be a management problem. Apple has total control over the hardware, total control over third party developers, and $203 billion in cash. What are they doing wrong?\n\nApple has the resources to approach software like aerospace. Formal interface specs, heavy Q/A, tough regression tests, formal methods. It's expensive, but Apple ships so many copies that the cost per unit is insignificant.\n\nMicrosoft did that, starting with Windows 7. Two things made Windows 7 stable. The first was the Static Driver Verifier, which examines driver source code to check if there's any way it can crash the rest of the OS. This includes buffer overflows. The driver may not work, but it won't take the rest of the kernel down with it. All signed drivers have passed the Static Driver Verifier, which anyone can run. Driver-caused crashes stopped being a big problem.\nWith the driver problem out of the way, any remaining kernel crashes were clearly Microsoft's fault. (This has the nice problem that kernel bugs could no longer be blamed on third party drivers.) Microsoft had a classifier system developed which tries to group similar crash reports together and send the group to the same developer. It's hard to ignore a bug when a thousand reports of crashes from the same bug have been grouped together.\nThat's part of how Microsoft finally got a handle on their software products. Is Apple doing anything like this?"
   },
   {  
      "content":"I blame the stock market pressure towards growth.\n\n```javascript\nconst admin = {\n  username: 'admin',\n  password: 'pass',\n  isAdmin: true\n}\n```\n\n The stock market rewards growth at the expense of everything else. It's like a kid pinching his arm to blow up a mosquito that was biting him- it's forced to grow and grow and grow until it pops. It's no longer acceptable to simply run a profitable business with happy employees and customers."
   },
   {  
      "content":"It creates a push towards constant acceleration in all things- shorter release cycles, more product categories, etc. This supplies the continuous growth that shareholders demand right up until the point where it kills the host."
   }
]